### Problem 1

How to import pandas and check the version?

In [3]:
import pandas as pd

In [4]:
pd.__version__

'1.3.5'

---------------------------------------------------------------------------------------------------------------------

### Problem 2

Create a pandas series from each of the items below: a list, numpy and a dictionary

Input

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```

In [5]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [145]:
seriesFromLst = pd.Series(mylist)
#seriesFromLst

In [146]:
seriesFromArray = pd.Series(myarr)
#seriesFromArray

In [147]:
seriesFromDict = pd.Series(mydict)
#seriesFromDict

---------------------------------------------------------------------------------------------------------------------

### Problem 3

Convert the series ser into a dataframe with its index as another column on the dataframe.

Input

```
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
```

In [148]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [149]:
## Solutions 1
# df = pd.DataFrame(ser).reset_index()
# df

## Solutions 2
df = ser.to_frame().reset_index()
#df

---------------------------------------------------------------------------------------------------------------------

### Problem 4

Combine ser1 and ser2 to form a dataframe.

Input:

```
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))
```

In [150]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [151]:
df = pd.concat([ser1, ser2], axis=1)
#df

---------------------------------------------------------------------------------------------------------------------

### Problem 5

Get all items of ser1 and ser2 not common to both.

Input

```
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
```

In [152]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [153]:
# import image module
from IPython.display import Image
# get the image
Image(url = "unionIntersection.jpg", width = 150, height = 150)

In [154]:
# union of the series
union = pd.Series(np.union1d(ser1, ser2))
  
# intersection of the series
intersect = pd.Series(np.intersect1d(ser1, ser2))
  
# uncommon elements in both the series 
notcommonseries = union[~union.isin(intersect)]
  
# displaying the result
print(notcommonseries)

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

---------------------------------------------------------------------------------------------------------------------

### Problem 6

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

Input

```
ser = pd.Series(np.random.normal(10, 5, 25))

```

In [155]:
ser = pd.Series(np.random.normal(10, 5, 25))
#ser

In [156]:
result = np.percentile(ser, q = [0, 25, 50, 75, 100])
# print(f"Minimum: {round(result[0], 3)}")
# print(f"25th percentile: {round(result[1], 3)}")
# print(f"median: {round(result[2], 3)}")
# print(f"75th: {round(result[3], 3)}")
# print(f"Maximum: {round(result[4], 3)}")

# or
df = pd.DataFrame(result, index = ["Min", "25th Percentile", "Median", "75th Percentile", "Max"], columns = ["Values"])
df

                    Values
Min               5.265623
25th Percentile   9.161426
Median           10.867974
75th Percentile  12.226720
Max              16.854332

---------------------------------------------------------------------------------------------------------------------

### Problem 7

Calculte the frequency counts of each unique value ser.

Input

```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [157]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [158]:
df = pd.DataFrame(ser.value_counts(), columns = ["Freq"])
df

   Freq
d     8
b     4
g     4
c     4
h     4
e     2
a     2
f     2

---------------------------------------------------------------------------------------------------------------------

### Problem 8

From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

Input

```

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
```

In [16]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [17]:
ser

0     4
1     1
2     4
3     4
4     3
5     1
6     1
7     3
8     3
9     4
10    2
11    3
dtype: int32

In [160]:
top2 = ser.value_counts()[:2]
top2.index

Int64Index([1, 2], dtype='int64')

In [161]:
lst = []
for i in ser:
    if (i != top2.index[0]) and (i != top2.index[1]):
        lst.append("Other")
    else:
        lst.append(i)
        
newSer = pd.Series(lst)
print("\nResult")
print("------")
newSer

Result
-------

0         1
1         2
2         1
3     Other
4         2
5         1
6         1
7         2
8         1
9         2
10    Other
11    Other
dtype: object

---------------------------------------------------------------------------------------------------------------------

### Problem 9

Bin the series ser into 10 equal deciles and replace the values with the bin name.

Input
```
ser = pd.Series(np.random.random(20))
```
Desired Output

```
# First 5 items
0    7th
1    9th
2    7th
3    3rd
4    8th
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]
```

In [13]:
np.random.RandomState(100)
ser = pd.Series(np.random.random(20))

In [14]:
ser

0     0.693974
1     0.188379
2     0.254751
3     0.500827
4     0.701042
5     0.338687
6     0.532986
7     0.680759
8     0.491304
9     0.255051
10    0.180674
11    0.070021
12    0.229824
13    0.534231
14    0.742788
15    0.670751
16    0.864891
17    0.617295
18    0.124056
19    0.112346
dtype: float64

In [163]:
bin_labels = ['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']
bins = pd.qcut(ser, q = 10, labels = bin_labels)

print("\nResult")
print("------")
bins

Result
-------

0      1st
1      5th
2      3rd
3     10th
4      7th
5     10th
6      2nd
7      1st
8      2nd
9      7th
10     9th
11     8th
12     3rd
13     6th
14     4th
15     8th
16     9th
17     5th
18     6th
19     4th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

---------------------------------------------------------------------------------------------------------------------

### Problem 10

Reshape the series ser into a dataframe with 7 rows and 5 columns

Input

```
ser = pd.Series(np.random.randint(1, 10, 35))
```

In [164]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 10, 35))

In [165]:
reshapedSeries = ser.values.reshape(7, 5)
df = pd.DataFrame(reshapedSeries, 
                  index = ["Row 1", "Row 2", "Row 3", "Row 4", "Row 5", "Row 6", "Row 7"], 
                  columns = ["Col 1", "Col 2", "Col 3", "Col 4", "Col 5"])
df

       Col 1  Col 2  Col 3  Col 4  Col 5
Row 1      6      7      2      9      7
Row 2      8      8      9      8      8
Row 3      3      3      3      4      9
Row 4      7      7      3      1      6
Row 5      1      4      8      1      7
Row 6      3      2      9      9      2
Row 7      4      1      9      5      7

---------------------------------------------------------------------------------------------------------------------

### Problem 11 

Find the positions of numbers that are multiples of 3 from ser.

Input

```
ser = pd.Series(np.random.randint(1, 10, 7))
```

In [166]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    6
1    4
2    5
3    4
4    5
5    5
6    1
dtype: int32

In [167]:
for i in ser[ser % 3 == 0].index:
    print("Index/Position", i)

Index/Position 0

---------------------------------------------------------------------------------------------------------------------

### Problem 12

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

Input

```
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
```

In [168]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [169]:
# stacking the series horizontally
df = pd.concat([ser1, ser2], axis = 1)
print("------------------------------------------------")
print("Stack two series 'ser1' and 'ser2' horizontally |")
print("------------------------------------------------")
df

------------------------------------------------
Stack two series 'ser1' and 'ser2' horizontally |
------------------------------------------------

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [170]:
# Stacking the series vertically
df = pd.concat([ser1, ser2], axis = 0)
print("----------------------------------------------")
print("Stack two series 'ser1' and 'ser2' vertically |")
print("----------------------------------------------")
df

----------------------------------------------
Stack two series 'ser1' and 'ser2' vertically |
----------------------------------------------

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

---------------------------------------------------------------------------------------------------------------------

### Problem 13

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

Input
```
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
```

In [171]:
# same as above

---------------------------------------------------------------------------------------------------------------------

### Problem 14


Get the day of month, week number, day of year and day of week from ser.

Input
```
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
```
Desired output
```
Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day num of year:  [1, 33, 63, 94, 125, 157]
Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']
```

In [172]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [173]:
df = pd.DataFrame(ser, columns = ['DateTimeObject'])
df['DateTimeObject'] = df['DateTimeObject'].astype('datetime64[ns]').dt.normalize() #dt.normalize is used when time is not important

In [174]:
df

  DateTimeObject
0     2010-01-01
1     2011-02-02
2     2012-03-03
3     2013-04-04
4     2014-05-05
5     2015-06-06

In [175]:
df['Date'] = df['DateTimeObject'].dt.day
df['Week number'] = df['DateTimeObject'].dt.isocalendar().week
df['Day num of year'] = df['DateTimeObject'].dt.dayofyear
df['Day of week'] = df['DateTimeObject'].dt.day_name()
df

  DateTimeObject  Date  Week number  Day num of year Day of week
0     2010-01-01     1           53                1      Friday
1     2011-02-02     2            5               33   Wednesday
2     2012-03-03     3            9               63    Saturday
3     2013-04-04     4           14               94    Thursday
4     2014-05-05     5           19              125      Monday
5     2015-06-06     6           23              157    Saturday

In [176]:
print("\nRequired Result")
print("---------------")

print(f"Date: {df['Date'].tolist()}")
print(f"Week number: {df['Week number'].tolist()}")
print(f"Day num of year: {df['Day num of year'].tolist()}")
print(f"Day of week: {df['Day of week'].tolist()}")

Required Result
----------------
Date: [1, 2, 3, 4, 5, 6]
Week number: [53, 5, 9, 14, 19, 23]
Day num of year: [1, 33, 63, 94, 125, 157]
Day of week: ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

---------------------------------------------------------------------------------------------------------------------

### Problem 15

From ser, extract words that contain atleast 2 vowels.

Input
```
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
```

Desired Output
```
0     Apple
1    Orange
4     Money
dtype: object
```

In [4]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [178]:
def count_num_vowels(ser):
    count = 0
    lst = []
    for i in ser:
        for k in i:
            if k == 'a' or k == 'A' or k == 'e' or k == 'E' or k == 'i' or k == 'I' or k == 'o' or k == 'O' or k == 'u' or k == 'U':
                count += 1
        if count >= 2:
            lst.append(i)
        count = 0
    return pd.Series(lst) 


print("\nResult")
print("------")
count_num_vowels(ser)

Result
-------

0     Apple
1    Orange
2     Money
dtype: object

In [5]:
# or

In [6]:
from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

In [10]:
# suppose
x = "Apple"
[Counter(x.lower()).get(i, 0) for i in list('aeiou')]

[1, 1, 0, 0, 0]

In [15]:
list('aeiou')

['a', 'e', 'i', 'o', 'u']

In [ ]:
you could write for statement as follows 
for i in ['a', 'e', 'i', 'o', 'u']:
but writing it as list('aeiou') is simpler way

---------------------------------------------------------------------------------------------------------------------

### Problem 16


Check if df has any missing values.

Input

```
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
```

In [179]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [180]:
#df.head(2)

In [181]:
#df.isna().any()
#df.isna().sum()
#df.isnull()
df.any()

Manufacturer          True
Model                 True
Type                  True
Min.Price             True
Price                 True
Max.Price             True
MPG.city              True
MPG.highway           True
AirBags               True
DriveTrain            True
Cylinders             True
EngineSize            True
Horsepower            True
RPM                   True
Rev.per.mile          True
Man.trans.avail       True
Fuel.tank.capacity    True
Passengers            True
Length                True
Wheelbase             True
Width                 True
Turn.circle           True
Rear.seat.room        True
Luggage.room          True
Weight                True
Origin                True
Make                  True
dtype: bool

In [182]:
#print(f"Total Missing Values: {df.isnull().sum().sum()}")

---------------------------------------------------------------------------------------------------------------------

### Problem 17

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

Input
```
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
```

In [183]:
print("\nColumns with Missing Values:")
print("---------------------------")
df.isnull().sum()

Columns with Missing Values:
----------------------------

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

In [184]:
print(f"\nColumn name '{df.isnull().sum().idxmax()}' has the maximum missing values")

Column name 'Luggage.room' has the maximum missing values

---------------------------------------------------------------------------------------------------------------------

### Problem 18

Replace missing values in Min.Price and Max.Price columns with their respective mean.

Input

```
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
```

In [185]:
# df["Min.Price"].fillna(round(df["Min.Price"].mean(), 1), inplace = True)
# df["Max.Price"].fillna(round(df["Max.Price"].mean(), 1), inplace = True)

df[["Min.Price", "Max.Price"]] = df[["Min.Price", "Max.Price"]].fillna(df[["Min.Price", "Max.Price"]].mean())

print(f"Now Missing Values in 'Min.Price' Column is {df['Min.Price'].isnull().sum()}")
print(f"Now Missing Values in 'Max.Price' Column is {df['Max.Price'].isnull().sum()}")

Now Missing Values in 'Min.Price' Column is 0
Now Missing Values in 'Max.Price' Column is 0

---------------------------------------------------------------------------------------------------------------------

### Problem 19

In df, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

Input

```
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

```

In [186]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [187]:
df.head(5)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [188]:
def fillna_mean(x):
    x['Min.Price'] = round(df["Min.Price"].mean(), 1) if np.isnan(x['Min.Price']) else x['Min.Price']
    return x

def fillna_median(x):
    x['Max.Price'] = round(df["Max.Price"].median(), 1) if np.isnan(x['Max.Price']) else x['Max.Price']
    return x

In [189]:
df = df.apply(fillna_mean, axis = 1)
df = df.apply(fillna_median, axis = 1)

In [190]:
df.head(5)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.1,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.1,30.0,19.2,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

---------------------------------------------------------------------------------------------------------------------

### Problem 20

Get the first column (a) in df as a dataframe (rather than as a Series).

Input

```
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
```

In [191]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [192]:
dfa = pd.DataFrame(df['a'])
dfa

    a
0   0
1   5
2  10
3  15

---------------------------------------------------------------------------------------------------------------------

### Problem 21

1 - In df, interchange columns 'a' and 'c'.

2 - Create a generic function to interchange two columns, without hardcoding column names.

3 - Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

Input

```

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
```

In [193]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

#### 1 - In df, interchange columns 'a' and 'c'.

In [194]:
df_interchanged_cols = df[['c', 'b', 'a', 'd', 'e']]


print("\n1 - df with interchanged columns 'a' and 'c'")
print("--------------------------------------------")
df_interchanged_cols

1 - df with interchanged columns 'a' and 'c'
--------------------------------------------

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

#### 2 - Create a generic function to interchange two columns, without hardcoding column names.

In [195]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [196]:
def interchange_two_columns(df, col_1 = None, col_2 = None):
    col_names = df.columns.tolist()
    i1, i2 = col_names.index(col_1), col_names.index(col_2)
    col_names[i2], col_names[i1] = col_names[i1], col_names[i2]
    return df[col_names]


df_interchanged_cols = interchange_two_columns(df, 'a', 'c')

print("\n2 - df with interchanged columns 'a' and 'c' through generic function")
print("----------------------------------------------------------------------")
df_interchanged_cols

2 - df with interchanged columns 'a' and 'c' through generic function
----------------------------------------------------------------------

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

#### 3 - Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [197]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [198]:
df_col_reversed = df[sorted(df.columns, reverse = True)]

print("\n3 - Sort the columns in reverse alphabetical order")
print("---------------------------------------------------")
df_col_reversed

3 - Sort the columns in reverse alphabetical order
----------------------------------------------------

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

---------------------------------------------------------------------------------------------------------------------

### Problem 22

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

Input

```
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
```

In [199]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head(1)

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra

In [200]:
# df.iloc[::20, :]

print("\nResulting df after filtering Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st")
print("----------------------------------------------------------------------------------------------------")
df.iloc[::20, :][['Manufacturer', 'Model', 'Type']]

Resulting df after filtering Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st
--------------------------------------------------------------------------------------------------

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

---------------------------------------------------------------------------------------------------------------------

### Problem 23 

Find the row position of the 5th largest value of column 'a' in df.

Input

```
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
```

In [201]:
np.random.RandomState(100)
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
df['a'].sort_values(ascending = False)

9    28
3    27
8    19
5    18
6    17
4    16
2    14
7    13
0    12
1     5
Name: a, dtype: int32

In [202]:
row_pos = df['a'].sort_values(ascending = False).reset_index()[4:5]['index'].values[0]

print("---------------------------------------------------------------")
print(f"Row position of the 5th largest value of column 'a' in df is {row_pos} |")
print("---------------------------------------------------------------")

---------------------------------------------------------------
Row position of the 5th largest value of column 'a' in df is 6 |
---------------------------------------------------------------

#### or

In [203]:
n = 5
row_pos = df['a'].argsort()[::-1][n]

print("---------------------------------------------------------------")
print(f"Row position of the 5th largest value of column 'a' in df is {row_pos} |")
print("---------------------------------------------------------------")

---------------------------------------------------------------
Row position of the 5th largest value of column 'a' in df is 6 |
---------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------

### Problem 24 

In ser, find the position of the 2nd largest value greater than the mean.

Input
```
ser = pd.Series(np.random.randint(1, 100, 15))
```

In [6]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 100, 15))

In [7]:
def idx_2nd_largest_ser(ser):
    lst = []
    for i in ser:
        if i > ser.mean():
            lst.append(i)
    lst = list(set(lst))
    lst = sorted(lst, reverse = True)
    lst.remove(max(lst))
    return ser[ser == lst[0]].index[0]

In [8]:
idx = idx_2nd_largest_ser(ser)

print("---------------------------------------------------------------------------------")
print(f"Position/Index of the 2nd largest value greater than the mean of the series is {idx} |")
print("---------------------------------------------------------------------------------")

---------------------------------------------------------------------------------
Position/Index of the 2nd largest value greater than the mean of the series is 11 |
---------------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------

### Problem 25


Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

Input

```
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
```
Output

```
   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24
```

In [207]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

In [208]:
df_one_hot_encoded = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis = 1)

print(f"\nGet one-hot encodings for column 'a' in the dataframe df and append it as columns |")
print("----------------------------------------------------------------------------------")
df_one_hot_encoded

Get one-hot encodings for column 'a' in the dataframe df and append it as columns |
----------------------------------------------------------------------------------

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

---------------------------------------------------------------------------------------------------------------------